

<?php include('include/header.php') ?>

<section>
  <div class="container dop_bd levels levels--1">
    <div class="row">
      <div class="title">
        Уровень безопасности
      </div>
      <div class="levels__text">
        <p>Мы делаем все необходимое, чтобы защитить ваши Электронные Письма - начиная от SSL-сертификата на нашем Вебсайте и заканчивая шифрованием всего контента на стороне базы данных, расположенной на наших серверах</p>
        <p>Пожалуйста, обратите внимание, <a href="#">мы не имеем прямого доступа к вашим Электронным Письмам</a></p>
        <p>Вы можете чувствовать себя спокойно в любой области вашей жизни - всё зашифровано!</p>
      </div>
    </div>
  </div>
  <div class="container dop_bd levels levels--2">
    <div class="row">
      <div class="title_dop">
        Соглашение об уровне сервиса (SLA)
      </div>
      <div class="levels__text">
        <p>Наш сервис имеет 99,99% доступность, что гарантируется нашим инфраструктурным партнёром Microsoft и таким же значением сервиса <a href="#">Swanager</a>. Это означает, что максимальное время, когда наш сервис недоступен, составляет <span class="bold">4 минуты*</span> в месяц (30 дней, 24/7) для Вебсайта или Бота. Все Электронный Письма в этот период будут доставлены, поскольку у нас есть сервис по надёжному обслуживанию очередей, обеспечивающий обработку всего траффика</p>
        <p class="cursive">*4 минуты означает 4 минуты <span class="bold">максимально</span>, на настоящее время максимальный зарегистрированный downtime составил 3 минуты, и это было связанно с массивной DDoS атакой;</p>
      </div>
    </div>
  </div>
  <div class="container levels levels--3">
    <div class="row">
      <div class="title_dop">
        Конфиденциальность
      </div>
      <div class="levels__text">
        <p>Мы предоставляем анонимный сервис, но наша “анонимность” действует, пока действует анонимность Телеграма (или другого сервиса/провайдера). Мы не раскрываем никакую информацию о наших потребителях. Единственная вещь, которую мы делаем - это блокируем аккаунты за “нелегальные” действия. “Нелегальные” означает поступление сообщения о нарушениях с реальными доказательствами. Всех случаи рассматриваются индивидуально нашими операторами. Для получения большей информации вы можете посмотреть соответствующую секцию <a href="#">Соглашение об использовании</a>. Если вы хотите сообщить о нарушении, пожалуйста, напишите на <a href="mailto:abuse@etlgr.com">abuse@etlgr.com</a>, предоставив как можно больше информации.</p>
      </div>
    </div>
  </div>
</section>      

<?php include('include/footer.php') ?>