

<?php include('include/header.php') ?>

<section>
  <div class="container">
    <div class="row">
      <div class="title">
        Мы делаем жизнь лучше
      </div>
      <div class="missia__text">
        Социальные сети уступают место Мессенджерам, в которых может быть доступно всё: банки, магазины, консалтинговые агентства и т.д. Традиционные сервисы электронной почты являются слишком старыми для современного мира. Все известные email-клиенты используются для “проверки писем”, чтобы получить эти письма по протоколу POP3 (или же другому). Это создаёт задержку между реальным временем отправки письма и его получением. Но обмен сообщениями в реальном времени означает функционирующие службы в реальном времени, даже отправку и получение Электронных Писем в реальном времени.
      </div>
    </div>
    <div class="row">
      <div class="title">
        Стратегия
      </div>
      <div class="missia__text">
        Наша цель - создать мульти-платформенное решение по отправке электронных писем. Мы собираемся сделать это для всех популярных IM-сервисов, которые имеют возможность создавать ботов: Slack, Whatsapp, Viber и Facebook Messenger.
        <div class="missia__img">
          <img src="/images/missia.jpg" alt="">
        </div>
      </div>
    </div>
    <div class="row">
      <div class="title">
        Кто за сценой?
      </div>
      <div class="missia__photo_block">
        <div class="missia__text color_text">
          Я:)
        </div>
        <div class="missia__photo"><img src="/images/missia__photo.jpg" alt=""></div>
        <div class="missia__name">Евгений Хашин</div>
        <div class="missia__text">CTO / Сооснователь Dokkur / Swanager</div>
      </div>
      <div class="title_dop">Как всё было на самом деле</div>
      <div class="missia__text">
        <p> Это был солнечный день в начале весны 2016 года… Лол, прошу прощения, постараюсь уложить свой рассказ в несколько предложений.</p>
        <p> Решая вопрос о получения в реальном времени уведомлений из Telegram Messenger мы создали маленького бота, который мог осуществлять только простую пересылку электронных писем из любого стороннего сервиса в любой канал или любую дискуссию в Telegram. Существует только один путь интегрировать что угодно с чем угодно - использовать email-протокол (RFC-). Это было “проворное” решение, т. к. email-уведомления поддерживаются большей частью всего возможного программного и аппаратного обеспечения. Email + Telegram = Любовь. В первый месяц нашего бота установили огромное количество людей, поэтому нам необходимо было сделать что-то с масштабированием, чтобы поддерживать работу.</p>
        <p> С другой стороны, создавая платформу по развертыванию веб-приложений Dokkur (сейчас Swanager), мы тестировали механизм горизонтального масштабирования, основанный на инфраструктуре контейнеров Dokkur.</p>
        <p> В результате полнофункциональный email-клиент был запущен на масштабируемой инфраструктуре. Большое спасибо нашим коллегам из Microsoft за то, что были нам хорошими наставниками, а также за техническую поддержку.</p>
      </div>
    </div>
    <div class="row">
      <div class="missia__text">
        Конечно, наша история только начинается. Она подразумевает огромное количество возможных кейсов, и вы можете узнать, как IM Emailing может помочь <a href="#">вам</a> и <a href="#">вашему бизнесу.</a>
      </div>
    </div>
  </div>
</section>      

<?php include('include/footer.php') ?>